{"config": {"output_layers": [["dense_2", 0, 0]], "layers": [{"config": {"sparse": false, "batch_input_shape": [null, null, 4], "name": "input_1", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "padding": "valid", "strides": [1], "use_bias": true, "name": "conv1d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [10], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 64}, "class_name": "Conv1D", "name": "conv1d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"config": {"pool_size": [5], "trainable": true, "padding": "valid", "strides": [5], "data_format": "channels_last", "name": "average_pooling1d_1"}, "class_name": "AveragePooling1D", "name": "average_pooling1d_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"config": {"noise_shape": null, "seed": null, "name": "spatial_dropout1d_1", "trainable": true, "rate": 0.5}, "class_name": "SpatialDropout1D", "name": "spatial_dropout1d_1", "inbound_nodes": [[["average_pooling1d_1", 0, 0, {}]]]}, {"config": {"activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "padding": "valid", "strides": [1], "use_bias": true, "name": "conv1d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [2], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "filters": 128}, "class_name": "Conv1D", "name": "conv1d_2", "inbound_nodes": [[["spatial_dropout1d_1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"config": {"pool_size": [20], "trainable": true, "padding": "valid", "strides": [20], "data_format": "channels_last", "name": "average_pooling1d_2"}, "class_name": "AveragePooling1D", "name": "average_pooling1d_2", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"config": {"noise_shape": null, "seed": null, "name": "spatial_dropout1d_2", "trainable": true, "rate": 0.5}, "class_name": "SpatialDropout1D", "name": "spatial_dropout1d_2", "inbound_nodes": [[["average_pooling1d_2", 0, 0, {}]]]}, {"config": {"activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "units": 64, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["spatial_dropout1d_2", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "global_average_pooling1d_1", "trainable": true}, "class_name": "GlobalAveragePooling1D", "name": "global_average_pooling1d_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "name": "dense_2", "activity_regularizer": null, "kernel_constraint": null, "units": 2, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["global_average_pooling1d_1", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4"}