{"config": {"input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0]], "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, null], "name": "input_1", "sparse": false}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"dtype": "float32", "batch_input_shape": [null, null], "name": "input_2", "sparse": false}, "name": "input_2", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "batch_input_shape": [null, null], "input_length": null, "activity_regularizer": null, "output_dim": 100, "trainable": true, "dtype": "float32", "input_dim": 15626, "embeddings_constraint": null, "name": "embedding_1", "mask_zero": false}, "name": "embedding_1", "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "batch_input_shape": [null, null], "input_length": null, "activity_regularizer": null, "output_dim": 100, "trainable": true, "dtype": "float32", "input_dim": 15626, "embeddings_constraint": null, "name": "embedding_2", "mask_zero": false}, "name": "embedding_2", "class_name": "Embedding", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"dtype": "float32", "batch_input_shape": [null, 1], "name": "input_3", "sparse": false}, "name": "input_3", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"seed": null, "trainable": true, "name": "dropout_1", "rate": 0.2, "noise_shape": null}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"config": {"seed": null, "trainable": true, "name": "dropout_2", "rate": 0.2, "noise_shape": null}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "repeat_vector_1", "n": 100}, "name": "repeat_vector_1", "class_name": "RepeatVector", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"config": {"axis": 1, "trainable": true, "name": "concatenate_1"}, "name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["dropout_1", 0, 0, {}], ["dropout_2", 0, 0, {}]]]}, {"config": {"dims": [2, 1], "trainable": true, "name": "permute_1"}, "name": "permute_1", "class_name": "Permute", "inbound_nodes": [[["repeat_vector_1", 0, 0, {}]]]}, {"config": {"axis": 1, "trainable": true, "name": "concatenate_2"}, "name": "concatenate_2", "class_name": "Concatenate", "inbound_nodes": [[["concatenate_1", 0, 0, {}], ["permute_1", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "dilation_rate": [1], "kernel_size": [6], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "strides": [1], "filters": 128, "name": "conv1d_1", "use_bias": true, "bias_constraint": null, "activation": "linear", "padding": "valid", "kernel_regularizer": null}, "name": "conv1d_1", "class_name": "Conv1D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "dilation_rate": [1], "kernel_size": [6], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "strides": [1], "filters": 128, "name": "conv1d_3", "use_bias": true, "bias_constraint": null, "activation": "linear", "padding": "valid", "kernel_regularizer": null}, "name": "conv1d_3", "class_name": "Conv1D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "dilation_rate": [1], "kernel_size": [6], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "strides": [1], "filters": 128, "name": "conv1d_5", "use_bias": true, "bias_constraint": null, "activation": "linear", "padding": "valid", "kernel_regularizer": null}, "name": "conv1d_5", "class_name": "Conv1D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pooling1d_1", "pool_size": [5], "padding": "valid", "data_format": "channels_last", "strides": [5]}, "name": "max_pooling1d_1", "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pooling1d_3", "pool_size": [5], "padding": "valid", "data_format": "channels_last", "strides": [5]}, "name": "max_pooling1d_3", "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pooling1d_5", "pool_size": [5], "padding": "valid", "data_format": "channels_last", "strides": [5]}, "name": "max_pooling1d_5", "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "dilation_rate": [1], "kernel_size": [3], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "strides": [1], "filters": 256, "name": "conv1d_2", "use_bias": true, "bias_constraint": null, "activation": "linear", "padding": "valid", "kernel_regularizer": null}, "name": "conv1d_2", "class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "dilation_rate": [1], "kernel_size": [3], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "strides": [1], "filters": 256, "name": "conv1d_4", "use_bias": true, "bias_constraint": null, "activation": "linear", "padding": "valid", "kernel_regularizer": null}, "name": "conv1d_4", "class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "dilation_rate": [1], "kernel_size": [3], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "strides": [1], "filters": 256, "name": "conv1d_6", "use_bias": true, "bias_constraint": null, "activation": "linear", "padding": "valid", "kernel_regularizer": null}, "name": "conv1d_6", "class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_5", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pooling1d_2", "pool_size": [5], "padding": "valid", "data_format": "channels_last", "strides": [5]}, "name": "max_pooling1d_2", "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pooling1d_4", "pool_size": [5], "padding": "valid", "data_format": "channels_last", "strides": [5]}, "name": "max_pooling1d_4", "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pooling1d_6", "pool_size": [5], "padding": "valid", "data_format": "channels_last", "strides": [5]}, "name": "max_pooling1d_6", "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_6", 0, 0, {}]]]}, {"config": {"trainable": true, "recurrent_dropout": 0.0, "implementation": 1, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 100, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "go_backwards": false, "name": "lstm_1", "return_sequences": false, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "recurrent_regularizer": null, "dropout": 0.0, "stateful": false, "activation": "tanh", "return_state": false}, "name": "lstm_1", "class_name": "LSTM", "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "recurrent_dropout": 0.0, "implementation": 1, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 100, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "go_backwards": false, "name": "lstm_2", "return_sequences": false, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "recurrent_regularizer": null, "dropout": 0.0, "stateful": false, "activation": "tanh", "return_state": false}, "name": "lstm_2", "class_name": "LSTM", "inbound_nodes": [[["max_pooling1d_4", 0, 0, {}]]]}, {"config": {"trainable": true, "recurrent_dropout": 0.0, "implementation": 1, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 100, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "go_backwards": false, "name": "lstm_3", "return_sequences": false, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "recurrent_regularizer": null, "dropout": 0.0, "stateful": false, "activation": "tanh", "return_state": false}, "name": "lstm_3", "class_name": "LSTM", "inbound_nodes": [[["max_pooling1d_6", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 512, "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 512, "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null}, "name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_5", "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 512, "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null}, "name": "dense_5", "class_name": "Dense", "inbound_nodes": [[["lstm_3", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 10, "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 10, "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null}, "name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_6", "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 2, "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null}, "name": "dense_6", "class_name": "Dense", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}], "name": "model_1", "output_layers": [["dense_2", 0, 0], ["dense_4", 0, 0], ["dense_6", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4"}