{"class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, null], "dtype": "float32"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"trainable": true, "embeddings_regularizer": null, "embeddings_constraint": null, "batch_input_shape": [null, null], "name": "embedding_1", "input_length": null, "mask_zero": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "dtype": "float32", "output_dim": 100, "input_dim": 4097, "activity_regularizer": null}, "name": "embedding_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"use_bias": true, "name": "conv1d_3", "filters": 64, "strides": [1], "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "data_format": "channels_last", "kernel_size": [3]}, "name": "conv1d_3", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "name": "max_pooling1d_3", "strides": [20], "pool_size": [20], "trainable": true, "data_format": "channels_last"}, "name": "max_pooling1d_3", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 128, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}, "name": "dense_1", "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "data_format": "channels_last", "trainable": true}, "name": "global_max_pooling1d_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 10, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}, "name": "dense_2", "inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}]]]}]}, "keras_version": "2.2.4", "backend": "tensorflow"}