{"keras_version": "2.2.4", "config": {"output_layers": [["dense_4", 0, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null], "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null], "name": "input_2"}, "inbound_nodes": [], "name": "input_2", "class_name": "InputLayer"}, {"config": {"embeddings_constraint": null, "mask_zero": false, "name": "embedding_1", "input_length": null, "input_dim": 390626, "output_dim": 100, "embeddings_regularizer": null, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "batch_input_shape": [null, null], "trainable": true, "activity_regularizer": null, "dtype": "float32"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "embedding_1", "class_name": "Embedding"}, {"config": {"embeddings_constraint": null, "mask_zero": false, "name": "embedding_2", "input_length": null, "input_dim": 390626, "output_dim": 100, "embeddings_regularizer": null, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "batch_input_shape": [null, null], "trainable": true, "activity_regularizer": null, "dtype": "float32"}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "embedding_2", "class_name": "Embedding"}, {"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 1], "name": "input_3"}, "inbound_nodes": [], "name": "input_3", "class_name": "InputLayer"}, {"config": {"rate": 0.5, "seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"rate": 0.5, "seed": null, "trainable": true, "name": "dropout_2", "noise_shape": null}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout"}, {"config": {"n": 100, "trainable": true, "name": "repeat_vector_1"}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "repeat_vector_1", "class_name": "RepeatVector"}, {"config": {"axis": 1, "trainable": true, "name": "concatenate_1"}, "inbound_nodes": [[["dropout_1", 0, 0, {}], ["dropout_2", 0, 0, {}]]], "name": "concatenate_1", "class_name": "Concatenate"}, {"config": {"dims": [2, 1], "trainable": true, "name": "permute_1"}, "inbound_nodes": [[["repeat_vector_1", 0, 0, {}]]], "name": "permute_1", "class_name": "Permute"}, {"config": {"axis": 1, "trainable": true, "name": "concatenate_2"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}], ["permute_1", 0, 0, {}]]], "name": "concatenate_2", "class_name": "Concatenate"}, {"config": {"name": "conv1d_1", "strides": [1], "padding": "valid", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "dilation_rate": [1], "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "kernel_size": [8]}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "conv1d_1", "class_name": "Conv1D"}, {"config": {"name": "conv1d_2", "strides": [1], "padding": "valid", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "dilation_rate": [1], "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "kernel_size": [3]}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "name": "conv1d_2", "class_name": "Conv1D"}, {"config": {"pool_size": [20], "data_format": "channels_last", "name": "max_pooling1d_1", "strides": [20], "padding": "valid", "trainable": true}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "name": "max_pooling1d_1", "class_name": "MaxPooling1D"}, {"config": {"name": "bidirectional_1", "layer": {"config": {"units": 100, "recurrent_constraint": null, "use_bias": true, "kernel_constraint": null, "activation": "tanh", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "unroll": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "name": "lstm_1", "return_state": false, "go_backwards": false, "trainable": true, "return_sequences": false, "bias_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "implementation": 1, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, "trainable": true, "merge_mode": "concat"}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "name": "bidirectional_1", "class_name": "Bidirectional"}, {"config": {"units": 2048, "name": "dense_1", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"units": 1024, "name": "dense_2", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}, {"config": {"units": 512, "name": "dense_3", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense"}, {"config": {"units": 1, "name": "dense_4", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dense_4", "class_name": "Dense"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0]], "name": "model_1"}, "backend": "tensorflow", "class_name": "Model"}