{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 4], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"name": "conv1d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_size": [10], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "filters": 64, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "dilation_rate": [1], "strides": [1], "activity_regularizer": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "name": "conv1d_1", "kernel_constraint": null}}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_1", "axis": -1, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"name": "average_pooling1d_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "AveragePooling1D", "config": {"strides": [5], "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [5], "name": "average_pooling1d_1"}}, {"name": "conv1d_2", "inbound_nodes": [[["average_pooling1d_1", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_size": [2], "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "filters": 128, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "dilation_rate": [1], "strides": [1], "activity_regularizer": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "name": "conv1d_2", "kernel_constraint": null}}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "name": "batch_normalization_2", "axis": -1, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"name": "average_pooling1d_2", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "AveragePooling1D", "config": {"strides": [20], "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [20], "name": "average_pooling1d_2"}}, {"name": "dense_1", "inbound_nodes": [[["average_pooling1d_2", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_1", "activity_regularizer": null, "units": 64, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null}}, {"name": "spatial_dropout1d_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "SpatialDropout1D", "config": {"rate": 0.5, "seed": null, "noise_shape": null, "trainable": true, "name": "spatial_dropout1d_1"}}, {"name": "global_average_pooling1d_1", "inbound_nodes": [[["spatial_dropout1d_1", 0, 0, {}]]], "class_name": "GlobalAveragePooling1D", "config": {"trainable": true, "data_format": "channels_last", "name": "global_average_pooling1d_1"}}, {"name": "dense_2", "inbound_nodes": [[["global_average_pooling1d_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_2", "activity_regularizer": null, "units": 2, "activation": "softmax", "bias_regularizer": null, "kernel_constraint": null}}], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}}