{"backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, null, 4], "sparse": false, "name": "input_1", "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv1D", "name": "conv1d_1", "config": {"strides": [1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1], "kernel_size": [6], "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "name": "conv1d_1", "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_1", "config": {"strides": [5], "padding": "valid", "name": "max_pooling1d_1", "data_format": "channels_last", "trainable": true, "pool_size": [5]}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_2", "config": {"strides": [1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1], "kernel_size": [3], "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "name": "conv1d_2", "activity_regularizer": null, "filters": 128, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu"}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_2", "config": {"strides": [5], "padding": "valid", "name": "max_pooling1d_2", "data_format": "channels_last", "trainable": true, "pool_size": [5]}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "name": "global_max_pooling1d_1", "config": {"name": "global_max_pooling1d_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 2, "name": "dense_2", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}]]]}]}, "class_name": "Model", "keras_version": "2.2.4"}