{"keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "sparse": false, "dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"embeddings_regularizer": null, "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "activity_regularizer": null, "output_dim": 100, "input_length": null, "mask_zero": false, "embeddings_constraint": null, "name": "embedding_1", "input_dim": 4097, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1d_1", "class_name": "Conv1D", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true, "dilation_rate": [1], "filters": 32, "name": "conv1d_1", "activity_regularizer": null, "strides": [1], "kernel_size": [6], "activation": "relu", "padding": "valid", "bias_constraint": null}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "max_pooling1d_1", "class_name": "MaxPooling1D", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling1d_1", "strides": [5], "pool_size": [5]}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "conv1d_2", "class_name": "Conv1D", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true, "dilation_rate": [1], "filters": 64, "name": "conv1d_2", "activity_regularizer": null, "strides": [1], "kernel_size": [3], "activation": "relu", "padding": "valid", "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"name": "max_pooling1d_2", "class_name": "MaxPooling1D", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling1d_2", "strides": [20], "pool_size": [20]}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "activation": "relu"}, "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"name": "global_max_pooling1d_1", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_2", "activity_regularizer": null, "activation": "softmax"}, "inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}]]]}], "output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}}