{"backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, null], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "input_2", "config": {"name": "input_2", "dtype": "float32", "batch_input_shape": [null, null], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_1", "config": {"trainable": true, "activity_regularizer": null, "dtype": "float32", "embeddings_regularizer": null, "output_dim": 100, "embeddings_constraint": null, "mask_zero": false, "input_dim": 15626, "batch_input_shape": [null, null], "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "name": "embedding_1", "input_length": null}, "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "embedding_2", "config": {"trainable": true, "activity_regularizer": null, "dtype": "float32", "embeddings_regularizer": null, "output_dim": 100, "embeddings_constraint": null, "mask_zero": false, "input_dim": 15626, "batch_input_shape": [null, null], "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "name": "embedding_2", "input_length": null}, "class_name": "Embedding", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "input_3", "config": {"name": "input_3", "dtype": "float32", "batch_input_shape": [null, 1], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.5, "noise_shape": null}, "class_name": "Dropout", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "seed": null, "rate": 0.5, "noise_shape": null}, "class_name": "Dropout", "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "repeat_vector_1", "config": {"trainable": true, "name": "repeat_vector_1", "n": 100}, "class_name": "RepeatVector", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "axis": 1}, "class_name": "Concatenate", "inbound_nodes": [[["dropout_1", 0, 0, {}], ["dropout_2", 0, 0, {}]]]}, {"name": "permute_1", "config": {"trainable": true, "name": "permute_1", "dims": [2, 1]}, "class_name": "Permute", "inbound_nodes": [[["repeat_vector_1", 0, 0, {}]]]}, {"name": "concatenate_2", "config": {"trainable": true, "name": "concatenate_2", "axis": 1}, "class_name": "Concatenate", "inbound_nodes": [[["concatenate_1", 0, 0, {}], ["permute_1", 0, 0, {}]]]}, {"name": "conv1d_1", "config": {"trainable": true, "strides": [1], "padding": "valid", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_regularizer": null, "kernel_size": [6], "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1d_1", "filters": 128, "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv1D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "conv1d_2", "config": {"trainable": true, "strides": [1], "padding": "valid", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_regularizer": null, "kernel_size": [3], "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1d_2", "filters": 256, "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv1D", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "max_pooling1d_1", "config": {"trainable": true, "strides": [20], "padding": "valid", "name": "max_pooling1d_1", "pool_size": [20], "data_format": "channels_last"}, "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"name": "lstm_1", "config": {"trainable": true, "unit_forget_bias": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "kernel_regularizer": null, "bias_constraint": null, "implementation": 1, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "name": "lstm_1", "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activation": "tanh", "bias_regularizer": null, "return_state": false, "recurrent_regularizer": null, "stateful": false, "units": 100, "unroll": false, "recurrent_dropout": 0.0, "return_sequences": false}, "class_name": "LSTM", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"name": "dense_1", "config": {"trainable": true, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 512, "name": "dense_1"}, "class_name": "Dense", "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"name": "dense_2", "config": {"trainable": true, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 2, "name": "dense_2"}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "output_layers": [["dense_2", 0, 0]]}, "class_name": "Model", "keras_version": "2.2.4"}