{"keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, null]}}, {"inbound_nodes": [], "name": "input_2", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_2", "sparse": false, "batch_input_shape": [null, null]}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "embedding_1", "class_name": "Embedding", "config": {"output_dim": 32, "mask_zero": false, "input_length": null, "name": "embedding_1", "dtype": "float32", "activity_regularizer": null, "embeddings_constraint": null, "embeddings_regularizer": null, "input_dim": 390626, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "trainable": true, "batch_input_shape": [null, null]}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "embedding_2", "class_name": "Embedding", "config": {"output_dim": 32, "mask_zero": false, "input_length": null, "name": "embedding_2", "dtype": "float32", "activity_regularizer": null, "embeddings_constraint": null, "embeddings_regularizer": null, "input_dim": 390626, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "trainable": true, "batch_input_shape": [null, null]}}, {"inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "lstm_1", "class_name": "LSTM", "config": {"return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "unit_forget_bias": true, "stateful": false, "name": "lstm_1", "recurrent_constraint": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "implementation": 1, "units": 100, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "return_sequences": true, "bias_constraint": null, "use_bias": true, "dropout": 0.0, "activation": "tanh", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"inbound_nodes": [[["embedding_2", 0, 0, {}]]], "name": "lstm_2", "class_name": "LSTM", "config": {"return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "unit_forget_bias": true, "stateful": false, "name": "lstm_2", "recurrent_constraint": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "implementation": 1, "units": 100, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "return_sequences": true, "bias_constraint": null, "use_bias": true, "dropout": 0.0, "activation": "tanh", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"inbound_nodes": [[["lstm_1", 0, 0, {}], ["lstm_2", 0, 0, {}]]], "name": "dot_1", "class_name": "Dot", "config": {"normalize": true, "name": "dot_1", "trainable": true, "axes": 1}}, {"inbound_nodes": [[["lstm_1", 0, 0, {}]]], "name": "conv1d_1", "class_name": "Conv1D", "config": {"strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [8], "filters": 64, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "name": "conv1d_1", "use_bias": true, "activation": "linear", "dilation_rate": [1], "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "trainable": true}}, {"inbound_nodes": [[["lstm_2", 0, 0, {}]]], "name": "conv1d_2", "class_name": "Conv1D", "config": {"strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [8], "filters": 64, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "name": "conv1d_2", "use_bias": true, "activation": "linear", "dilation_rate": [1], "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "trainable": true}}, {"inbound_nodes": [[["dot_1", 0, 0, {}]]], "name": "conv1d_3", "class_name": "Conv1D", "config": {"strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [8], "filters": 64, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "name": "conv1d_3", "use_bias": true, "activation": "linear", "dilation_rate": [1], "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "trainable": true}}, {"inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "name": "max_pooling1d_1", "class_name": "MaxPooling1D", "config": {"strides": [5], "padding": "valid", "data_format": "channels_last", "name": "max_pooling1d_1", "trainable": true, "pool_size": [5]}}, {"inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "name": "max_pooling1d_2", "class_name": "MaxPooling1D", "config": {"strides": [5], "padding": "valid", "data_format": "channels_last", "name": "max_pooling1d_2", "trainable": true, "pool_size": [5]}}, {"inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "name": "max_pooling1d_3", "class_name": "MaxPooling1D", "config": {"strides": [5], "padding": "valid", "data_format": "channels_last", "name": "max_pooling1d_3", "trainable": true, "pool_size": [5]}}, {"inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null}}, {"inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "name": "dropout_2", "trainable": true, "seed": null}}, {"inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]], "name": "dropout_3", "class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "name": "dropout_3", "trainable": true, "seed": null}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "global_max_pooling1d_1", "class_name": "GlobalMaxPooling1D", "config": {"data_format": "channels_last", "name": "global_max_pooling1d_1", "trainable": true}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "global_max_pooling1d_2", "class_name": "GlobalMaxPooling1D", "config": {"data_format": "channels_last", "name": "global_max_pooling1d_2", "trainable": true}}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "global_max_pooling1d_3", "class_name": "GlobalMaxPooling1D", "config": {"data_format": "channels_last", "name": "global_max_pooling1d_3", "trainable": true}}, {"inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"units": 11, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "activation": "softmax", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["global_max_pooling1d_2", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense", "config": {"units": 11, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "name": "dense_2", "activation": "softmax", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["global_max_pooling1d_3", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense", "config": {"units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "name": "dense_3", "activation": "softmax", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true}}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0], ["dense_3", 0, 0]]}}