{"class_name": "Model", "config": {"output_layers": [["dense_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, null, 4]}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "kernel_size": [10], "filters": 64, "name": "conv1d_1", "strides": [1]}, "name": "conv1d_1"}, {"inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"scale": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_1", "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_1"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "name": "activation_1"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "MaxPooling1D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [5], "trainable": true, "name": "max_pooling1d_1", "strides": [5]}, "name": "max_pooling1d_1"}, {"inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_constraint": null, "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "kernel_size": [2], "filters": 128, "name": "conv1d_2", "strides": [1]}, "name": "conv1d_2"}, {"inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"scale": true, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "name": "batch_normalization_2", "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_2"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "name": "activation_2"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "MaxPooling1D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [20], "trainable": true, "name": "max_pooling1d_2", "strides": [20]}, "name": "max_pooling1d_2"}, {"inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "name": "dense_1"}, "name": "dense_1"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "SpatialDropout1D", "config": {"rate": 0.5, "seed": null, "noise_shape": null, "name": "spatial_dropout1d_1", "trainable": true}, "name": "spatial_dropout1d_1"}, {"inbound_nodes": [[["spatial_dropout1d_1", 0, 0, {}]]], "class_name": "GlobalMaxPooling1D", "config": {"data_format": "channels_last", "name": "global_max_pooling1d_1", "trainable": true}, "name": "global_max_pooling1d_1"}, {"inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "name": "dense_2"}, "name": "dense_2"}]}, "backend": "tensorflow", "keras_version": "2.2.4"}