{"backend": "tensorflow", "config": {"layers": [{"config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, null, 4], "dtype": "float32"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"rate": 0.2, "trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"activation": "relu", "kernel_size": [6], "padding": "valid", "dilation_rate": [1], "kernel_regularizer": null, "activity_regularizer": null, "name": "conv1d_1", "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1], "use_bias": true, "kernel_constraint": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D", "name": "conv1d_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [5], "padding": "valid", "data_format": "channels_last", "name": "max_pooling1d_1", "strides": [5]}, "class_name": "MaxPooling1D", "name": "max_pooling1d_1", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"config": {"activation": "relu", "kernel_size": [2], "padding": "valid", "dilation_rate": [1], "kernel_regularizer": null, "activity_regularizer": null, "name": "conv1d_2", "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "strides": [1], "use_bias": true, "kernel_constraint": null, "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv1D", "name": "conv1d_2", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "pool_size": [5], "padding": "valid", "data_format": "channels_last", "name": "max_pooling1d_2", "strides": [5]}, "class_name": "MaxPooling1D", "name": "max_pooling1d_2", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"config": {"activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "units": 128, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "global_max_pooling1d_1", "data_format": "channels_last"}, "class_name": "GlobalMaxPooling1D", "name": "global_max_pooling1d_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"activation": "softmax", "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "units": 2, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}]]]}], "output_layers": [["dense_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "keras_version": "2.2.4"}