{"config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [10, null], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"dtype": "float32", "batch_input_shape": [10, null], "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2", "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "input_dim": 390626, "trainable": true, "embeddings_constraint": null, "output_dim": 128, "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "name": "embedding_1", "mask_zero": false, "batch_input_shape": [null, null], "input_length": null, "dtype": "float32"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "embedding_1", "class_name": "Embedding"}, {"config": {"activity_regularizer": null, "input_dim": 390626, "trainable": true, "embeddings_constraint": null, "output_dim": 128, "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "name": "embedding_2", "mask_zero": false, "batch_input_shape": [null, null], "input_length": null, "dtype": "float32"}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "embedding_2", "class_name": "Embedding"}, {"config": {"trainable": true, "name": "bidirectional_1", "layer": {"config": {"return_state": false, "bias_regularizer": null, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "trainable": true, "units": 100, "unroll": false, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 1, "name": "lstm_1", "go_backwards": false, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "unit_forget_bias": true, "stateful": true, "recurrent_dropout": 0.0, "return_sequences": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "recurrent_regularizer": null}, "class_name": "LSTM"}, "merge_mode": "concat"}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "bidirectional_1", "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "bidirectional_2", "layer": {"config": {"return_state": false, "bias_regularizer": null, "kernel_regularizer": null, "dropout": 0.0, "recurrent_constraint": null, "trainable": true, "units": 100, "unroll": false, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 1, "name": "lstm_2", "go_backwards": false, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "use_bias": true, "unit_forget_bias": true, "stateful": true, "recurrent_dropout": 0.0, "return_sequences": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "recurrent_regularizer": null}, "class_name": "LSTM"}, "merge_mode": "concat"}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "name": "bidirectional_2", "class_name": "Bidirectional"}, {"config": {"trainable": true, "axes": 1, "normalize": true, "name": "dot_1"}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["bidirectional_2", 0, 0, {}]]], "name": "dot_1", "class_name": "Dot"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "data_format": "channels_last", "trainable": true, "activation": "linear", "activity_regularizer": null, "kernel_size": [8], "filters": 128, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "name": "conv1d_1", "strides": [1], "kernel_constraint": null}, "inbound_nodes": [[["dot_1", 0, 0, {}]]], "name": "conv1d_1", "class_name": "Conv1D"}, {"config": {"data_format": "channels_last", "padding": "valid", "name": "max_pooling1d_1", "strides": [5], "trainable": true, "pool_size": [5]}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "name": "max_pooling1d_1", "class_name": "MaxPooling1D"}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "rate": 0.5, "name": "dropout_1"}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"name": "global_max_pooling1d_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "global_max_pooling1d_1", "class_name": "GlobalMaxPooling1D"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 512, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_constraint": null}, "inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 2, "activation": "sigmoid", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "kernel_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Model"}