{"config": {"layers": [{"config": {"batch_input_shape": [null, null, 4], "name": "input_1", "dtype": "float32", "sparse": false}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"use_bias": true, "kernel_size": [4], "dilation_rate": [1], "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "kernel_regularizer": null, "name": "conv1d_1", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "padding": "valid", "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv1D", "name": "conv1d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "beta_regularizer": null}, "class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"config": {"trainable": true, "strides": [5], "padding": "valid", "data_format": "channels_last", "name": "max_pooling1d_1", "pool_size": [5]}, "class_name": "MaxPooling1D", "name": "max_pooling1d_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"config": {"use_bias": true, "kernel_size": [2], "dilation_rate": [1], "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "kernel_regularizer": null, "name": "conv1d_2", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "padding": "valid", "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv1D", "name": "conv1d_2", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"config": {"gamma_constraint": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_2", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "beta_regularizer": null}, "class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"config": {"trainable": true, "strides": [20], "padding": "valid", "data_format": "channels_last", "name": "max_pooling1d_2", "pool_size": [20]}, "class_name": "MaxPooling1D", "name": "max_pooling1d_2", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"config": {"use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "units": 64, "bias_regularizer": null}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"config": {"noise_shape": null, "seed": null, "name": "spatial_dropout1d_1", "rate": 0.5, "trainable": true}, "class_name": "SpatialDropout1D", "name": "spatial_dropout1d_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "global_max_pooling1d_1", "trainable": true}, "class_name": "GlobalMaxPooling1D", "name": "global_max_pooling1d_1", "inbound_nodes": [[["spatial_dropout1d_1", 0, 0, {}]]]}, {"config": {"use_bias": true, "kernel_constraint": null, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "units": 2, "bias_regularizer": null}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4"}