{"class_name": "Model", "keras_version": "2.2.4", "config": {"output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, null, 4]}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_1", "config": {"name": "conv1d_1", "kernel_constraint": null, "strides": [1], "kernel_size": [4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "filters": 64, "activation": "linear", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"name": "batch_normalization_1", "axis": -1, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "MaxPooling1D", "name": "max_pooling1d_1", "config": {"name": "max_pooling1d_1", "strides": [5], "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [5]}}, {"inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_2", "config": {"name": "conv1d_2", "kernel_constraint": null, "strides": [1], "kernel_size": [2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "filters": 128, "activation": "linear", "dilation_rate": [1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"name": "batch_normalization_2", "axis": -1, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_2", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "MaxPooling1D", "name": "max_pooling1d_2", "config": {"name": "max_pooling1d_2", "strides": [20], "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [20]}}, {"inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 64, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "SpatialDropout1D", "name": "spatial_dropout1d_1", "config": {"rate": 0.5, "trainable": true, "name": "spatial_dropout1d_1", "noise_shape": null, "seed": null}}, {"inbound_nodes": [[["spatial_dropout1d_1", 0, 0, {}]]], "class_name": "GlobalMaxPooling1D", "name": "global_max_pooling1d_1", "config": {"name": "global_max_pooling1d_1", "trainable": true, "data_format": "channels_last"}}, {"inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2", "config": {"name": "dense_2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 2, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}, "backend": "tensorflow"}