{"backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "name": "input_8", "sparse": false, "batch_input_shape": [null, null, 4]}, "class_name": "InputLayer", "name": "input_8"}, {"inbound_nodes": [[["input_8", 0, 0, {}]]], "config": {"bias_regularizer": null, "activation": "linear", "bias_constraint": null, "padding": "valid", "kernel_regularizer": null, "trainable": true, "name": "conv1d_15", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "strides": [1], "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [10], "kernel_constraint": null}, "class_name": "Conv1D", "name": "conv1d_15"}, {"inbound_nodes": [[["conv1d_15", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "name": "batch_normalization_15", "beta_regularizer": null, "center": true, "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_15"}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_15"}, "class_name": "Activation", "name": "activation_15"}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"trainable": true, "strides": [5], "data_format": "channels_last", "pool_size": [5], "padding": "valid", "name": "max_pooling1d_15"}, "class_name": "MaxPooling1D", "name": "max_pooling1d_15"}, {"inbound_nodes": [[["max_pooling1d_15", 0, 0, {}]]], "config": {"bias_regularizer": null, "activation": "linear", "bias_constraint": null, "padding": "valid", "kernel_regularizer": null, "trainable": true, "name": "conv1d_16", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "strides": [1], "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [2], "kernel_constraint": null}, "class_name": "Conv1D", "name": "conv1d_16"}, {"inbound_nodes": [[["conv1d_16", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "name": "batch_normalization_16", "beta_regularizer": null, "center": true, "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_16"}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_16"}, "class_name": "Activation", "name": "activation_16"}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"trainable": true, "strides": [20], "data_format": "channels_last", "pool_size": [20], "padding": "valid", "name": "max_pooling1d_16"}, "class_name": "MaxPooling1D", "name": "max_pooling1d_16"}, {"inbound_nodes": [[["max_pooling1d_16", 0, 0, {}]]], "config": {"bias_regularizer": null, "units": 64, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_15", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense", "name": "dense_15"}, {"inbound_nodes": [[["dense_15", 0, 0, {}]]], "config": {"rate": 0.6, "noise_shape": null, "trainable": true, "name": "spatial_dropout1d_8", "seed": null}, "class_name": "SpatialDropout1D", "name": "spatial_dropout1d_8"}, {"inbound_nodes": [[["spatial_dropout1d_8", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "global_max_pooling1d_8"}, "class_name": "GlobalMaxPooling1D", "name": "global_max_pooling1d_8"}, {"inbound_nodes": [[["global_max_pooling1d_8", 0, 0, {}]]], "config": {"bias_regularizer": null, "units": 2, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_16", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense", "name": "dense_16"}], "output_layers": [["dense_16", 0, 0]], "name": "model_8", "input_layers": [["input_8", 0, 0]]}, "class_name": "Model", "keras_version": "2.2.4"}