{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "model_17", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_17", "config": {"sparse": false, "name": "input_17", "batch_input_shape": [null, null, 4], "dtype": "float32"}}, {"class_name": "Conv1D", "inbound_nodes": [[["input_17", 0, 0, {}]]], "name": "conv1d_33", "config": {"data_format": "channels_last", "activity_regularizer": null, "name": "conv1d_33", "bias_regularizer": null, "filters": 128, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "dilation_rate": [1], "kernel_constraint": null, "strides": [1], "kernel_size": [5], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_33", 0, 0, {}]]], "name": "batch_normalization_33", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_33", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_33", 0, 0, {}]]], "name": "activation_33", "config": {"name": "activation_33", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["activation_33", 0, 0, {}]]], "name": "max_pooling1d_33", "config": {"data_format": "channels_last", "padding": "valid", "pool_size": [5], "strides": [5], "name": "max_pooling1d_33", "trainable": true}}, {"class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_33", 0, 0, {}]]], "name": "conv1d_34", "config": {"data_format": "channels_last", "activity_regularizer": null, "name": "conv1d_34", "bias_regularizer": null, "filters": 256, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "dilation_rate": [1], "kernel_constraint": null, "strides": [1], "kernel_size": [2], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_34", 0, 0, {}]]], "name": "batch_normalization_34", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_34", "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null, "scale": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "center": true, "axis": -1, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_34", 0, 0, {}]]], "name": "activation_34", "config": {"name": "activation_34", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["activation_34", 0, 0, {}]]], "name": "max_pooling1d_34", "config": {"data_format": "channels_last", "padding": "valid", "pool_size": [20], "strides": [20], "name": "max_pooling1d_34", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["max_pooling1d_34", 0, 0, {}]]], "name": "dense_33", "config": {"activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_33", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "units": 64}}, {"class_name": "SpatialDropout1D", "inbound_nodes": [[["dense_33", 0, 0, {}]]], "name": "spatial_dropout1d_17", "config": {"seed": null, "rate": 0.6, "name": "spatial_dropout1d_17", "noise_shape": null, "trainable": true}}, {"class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["spatial_dropout1d_17", 0, 0, {}]]], "name": "global_max_pooling1d_17", "config": {"data_format": "channels_last", "name": "global_max_pooling1d_17", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["global_max_pooling1d_17", 0, 0, {}]]], "name": "dense_34", "config": {"activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_34", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "units": 2}}], "output_layers": [["dense_34", 0, 0]], "input_layers": [["input_17", 0, 0]]}}