{"config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null, 4], "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Conv1D", "name": "conv1d_1", "config": {"kernel_size": [32], "strides": [1], "name": "conv1d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "filters": 128, "kernel_regularizer": null, "padding": "valid", "use_bias": true, "trainable": true, "activity_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"gamma_regularizer": null, "axis": -1, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_1", "config": {"pool_size": [5], "strides": [5], "name": "max_pooling1d_1", "padding": "valid", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_2", "config": {"kernel_size": [2], "strides": [1], "name": "conv1d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "filters": 128, "kernel_regularizer": null, "padding": "valid", "use_bias": true, "trainable": true, "activity_regularizer": null}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"gamma_regularizer": null, "axis": -1, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_constraint": null}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_2", "config": {"pool_size": [20], "strides": [20], "name": "max_pooling1d_2", "padding": "valid", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "SpatialDropout1D", "name": "spatial_dropout1d_1", "config": {"name": "spatial_dropout1d_1", "rate": 0.6, "seed": null, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"activation": "relu", "bias_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 64, "kernel_regularizer": null, "use_bias": true, "trainable": true}, "inbound_nodes": [[["spatial_dropout1d_1", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "name": "global_max_pooling1d_1", "config": {"data_format": "channels_last", "trainable": true, "name": "global_max_pooling1d_1"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"activation": "softmax", "bias_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 2, "kernel_regularizer": null, "use_bias": true, "trainable": true}, "inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4"}