{"config": {"name": "model_8", "input_layers": [["input_8", 0, 0]], "layers": [{"name": "input_8", "config": {"sparse": false, "batch_input_shape": [null, null, 4], "dtype": "float32", "name": "input_8"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv1d_15", "config": {"name": "conv1d_15", "dilation_rate": [1], "filters": 128, "kernel_size": [10], "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "valid", "strides": [1], "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv1D", "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "batch_normalization_15", "config": {"name": "batch_normalization_15", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "scale": true, "beta_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": -1, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_15", 0, 0, {}]]]}, {"name": "activation_15", "config": {"name": "activation_15", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "max_pooling1d_15", "config": {"name": "max_pooling1d_15", "pool_size": [5], "padding": "valid", "trainable": true, "strides": [5], "data_format": "channels_last"}, "class_name": "MaxPooling1D", "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"name": "conv1d_16", "config": {"name": "conv1d_16", "dilation_rate": [1], "filters": 256, "kernel_size": [2], "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "valid", "strides": [1], "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_15", 0, 0, {}]]]}, {"name": "batch_normalization_16", "config": {"name": "batch_normalization_16", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "scale": true, "beta_regularizer": null, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "axis": -1, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_16", 0, 0, {}]]]}, {"name": "activation_16", "config": {"name": "activation_16", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "max_pooling1d_16", "config": {"name": "max_pooling1d_16", "pool_size": [20], "padding": "valid", "trainable": true, "strides": [20], "data_format": "channels_last"}, "class_name": "MaxPooling1D", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "dense_15", "config": {"name": "dense_15", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 64, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["max_pooling1d_16", 0, 0, {}]]]}, {"name": "spatial_dropout1d_8", "config": {"name": "spatial_dropout1d_8", "seed": null, "rate": 0.6, "noise_shape": null, "trainable": true}, "class_name": "SpatialDropout1D", "inbound_nodes": [[["dense_15", 0, 0, {}]]]}, {"name": "global_max_pooling1d_8", "config": {"name": "global_max_pooling1d_8", "data_format": "channels_last", "trainable": true}, "class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["spatial_dropout1d_8", 0, 0, {}]]]}, {"name": "dense_16", "config": {"name": "dense_16", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 2, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["global_max_pooling1d_8", 0, 0, {}]]]}], "output_layers": [["dense_16", 0, 0]]}, "keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow"}